In [1]:
import pandas as pd
import numpy as np

In [6]:
first = pd.Series(np.random.randint(low=1, high=5, size=100, dtype='int'))
second = pd.Series(np.random.randint(low=1, high=4, size=100, dtype='int'))
third = pd.Series(np.random.randint(low=10000, high=30001, size=100, dtype='int'))
third

0     19319
1     27333
2     25524
3     27166
4     20837
5     15838
6     14629
7     17811
8     17144
9     16989
10    29712
11    20223
12    15691
13    25124
14    15804
15    27701
16    27500
17    26268
18    13125
19    10253
20    16508
21    13030
22    11597
23    26829
24    25967
25    27493
26    25007
27    26893
28    17336
29    12083
      ...
70    10231
71    22344
72    27337
73    24538
74    25580
75    29987
76    19063
77    15987
78    25985
79    21814
80    14869
81    16424
82    11527
83    17284
84    27277
85    14876
86    14582
87    27322
88    24529
89    25387
90    10240
91    24537
92    15961
93    17325
94    10274
95    19701
96    18449
97    26558
98    27163
99    10932
Length: 100, dtype: int64

In [13]:
df = pd.concat([first, second, third], axis=1)
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>4</td>
      <td>1</td>
      <td>19319</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3</td>
      <td>2</td>
      <td>27333</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>2</td>
      <td>25524</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>3</td>
      <td>27166</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2</td>
      <td>3</td>
      <td>20837</td>
    </tr>
  </tbody>
</table>
</div>

In [16]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_market'}, inplace=True)
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>bedrs</th>
      <th>bathrs</th>
      <th>price_sqr_market</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>4</td>
      <td>1</td>
      <td>19319</td>
    </tr>
    <tr>
      <th>1</th>
      <td>3</td>
      <td>2</td>
      <td>27333</td>
    </tr>
    <tr>
      <th>2</th>
      <td>1</td>
      <td>2</td>
      <td>25524</td>
    </tr>
    <tr>
      <th>3</th>
      <td>1</td>
      <td>3</td>
      <td>27166</td>
    </tr>
    <tr>
      <th>4</th>
      <td>2</td>
      <td>3</td>
      <td>20837</td>
    </tr>
  </tbody>
</table>
</div>

In [22]:
big_column = pd.DataFrame(pd.concat([first, second, third]))
type(big_column)

pandas.core.frame.DataFrame

In [23]:
len(big_column)

300

In [ ]:
big_column.reset_index(drop=True)